#### 색인 객체

In [22]:
import pandas as pd
import numpy as np

In [8]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])

obj

a    0
b    1
c    2
dtype: int64

In [7]:
index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [6]:
index[1:]

Index(['b', 'c'], dtype='object')

In [11]:
labels = pd.Index(range(3))
# pd.Index(np.arange(3))

### 5.2 핵심 기능

In [12]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index = [0,2,4])

In [13]:
obj3.reindex(range(6), method = 'ffill') #Series 재색인

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [23]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'], columns = ['Ohio', 'Texas', 'California'])

In [24]:
frame2 = frame.reindex(['a', 'b', 'c', 'd']) #로우 순서 다시 적기

In [26]:
states = ['Texas', 'Utah', 'California']

In [28]:
frame.reindex(columns = states) #컬럼 재색인

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [31]:
frame.loc[['a', 'b', 'c', 'd'], states] #loc을 이용한 간결 재색인

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

#### 로우나 컬럼 삭제

In [32]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index = ['Ohio', 'Colorado', 'Utah', 'New York'], columns = ['one', 'two', 'tree', 'four'])

In [33]:
data.drop(['Colorado', 'Ohio'])

          one  two  tree  four
Utah        8    9    10    11
New York   12   13    14    15

In [34]:
data.drop('two', axis=1)

          one  tree  four
Ohio        0     2     3
Colorado    4     6     7
Utah        8    10    11
New York   12    14    15

In [35]:
data.drop(['two', 'four'], axis = 'columns')

          one  tree
Ohio        0     2
Colorado    4     6
Utah        8    10
New York   12    14

In [36]:
obj.drop('c', inplace = True)

#### (Sereis) 색인하기, 선택하기, 거르기

In [44]:
obj = pd.Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [41]:
obj['b'] #하나만 쓰면 로우 선택

1.0

In [42]:
obj[1] #위치: 1

1.0

In [43]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [45]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [46]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [48]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [50]:
obj['b':'c'] #라벨 이름으로 슬라이싱할 경우 시작점과 끝점을 포함

b    1.0
c    2.0
dtype: float64

In [51]:
obj['b':'c'] = 5

#### (DataFrame) 색인하기, 선택하기, 거르기

In [52]:
data = pd.DataFrame(np.arange(16).reshape((4,4)), index = ['Ohio', 'Colorado', 'Utah', 'New York'], columns = ['one', 'two', 'three', 'four'])

In [53]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [54]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [55]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [56]:
data[:2] #이건 또 웨 row가 선택되나..?

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [57]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### loc과 iloc으로 선택

In [58]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [59]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [60]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [61]:
data.iloc[[1,2], [3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [62]:
data.loc[:'Utah', 'two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

In [64]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

#### 정수 색인

In [65]:
ser2 = pd.Series(np.arange(3.), index = ['a', 'b', 'c'])
ser2[-1]

2.0

#### DataFrame 만드는 방법 ex

In [55]:
import pandas as pd
import numpy as np

In [5]:
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)), columns = list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [6]:
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)), columns = list('abcde'))

In [7]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### 함수 적용과 매핑

In [8]:
frame = pd.DataFrame(np.random.randn(4,3), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [9]:
frame

               b         d         e
Utah    0.991033  0.227452 -0.551814
Ohio   -0.450403 -0.401483  0.152538
Texas  -0.178315  0.755320  0.180346
Oregon  0.522446  1.707300 -1.206820

In [10]:
np.abs(frame)

               b         d         e
Utah    0.991033  0.227452  0.551814
Ohio    0.450403  0.401483  0.152538
Texas   0.178315  0.755320  0.180346
Oregon  0.522446  1.707300  1.206820

In [11]:
f = lambda x: x.max() - x.min()

In [13]:
frame.apply(f)

b    1.441437
d    2.108783
e    1.387166
dtype: float64

In [14]:
frame.apply(f, axis = 'columns')

Utah      1.542847
Ohio      0.602942
Texas     0.933635
Oregon    2.914120
dtype: float64

In [15]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [17]:
frame.apply(f) #apply는 로우 또는 컬럼에 대해 수행

            b         d         e
min -0.450403 -0.401483 -1.206820
max  0.991033  1.707300  0.180346

In [18]:
format = lambda x: '%.2f' % x

In [19]:
frame.applymap(format)

            b      d      e
Utah     0.99   0.23  -0.55
Ohio    -0.45  -0.40   0.15
Texas   -0.18   0.76   0.18
Oregon   0.52   1.71  -1.21

#### 정렬과 순위

In [20]:
obj = pd.Series(range(4), index = ['d', 'a', 'b', 'c'])

In [21]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [23]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)), index = ['three', 'one'], columns = ['d', 'a', 'b', 'c'])

In [24]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [25]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [26]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [28]:
frame = pd.DataFrame({'b': [4,7,-3,2], 'a': [0,1,0,1]})

In [29]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [30]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [31]:
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [32]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [34]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [35]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [36]:
obj.rank(ascending = False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [37]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})

#### 중복 색인

In [38]:
obj = pd.Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])

In [39]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [40]:
obj.index.is_unique

False

In [41]:
obj['a']

a    0
a    1
dtype: int64

In [42]:
obj['c']

4

In [44]:
df = pd.DataFrame(np.random.randn(4,3), index = ['a', 'a', 'b', 'b'])
df

          0         1         2
a -2.170933 -1.507658  0.822018
a -1.225157  0.357065  2.628094
b  0.018217 -0.889065 -0.791808
b -1.119660  0.928243  0.343658

In [45]:
df.loc['b']

          0         1         2
b  0.018217 -0.889065 -0.791808
b -1.119660  0.928243  0.343658

### 5.3 기술 통계 계산과 요약

In [46]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=['a', 'b', 'c', 'd'], columns = ['one', 'two'])

In [47]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [48]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [49]:
df.sum(axis = 'columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [50]:
df.mean(axis = 'columns', skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

#### 5.3.1 상관관계와 공분산

In [51]:
conda install pandas-datareader

Collecting package metadata: ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\Users\clue7\Anaconda3

  added / updated specs:
    - pandas-datareader


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    conda-4.7.11               |           py37_0         3.0 MB
    conda-package-handling-1.3.11|           py37_0         280 KB
    pandas-datareader-0.7.0    |           py37_0         141 KB
    ------------------------------------------------------------
                                           Total:         3.4 MB

The following NEW packages will be INSTALLED:

  conda-package-han~ pkgs/main/win-64::conda-package-handling-1.3.11-py37_0
  pandas-datareader  pkgs/main/win-64::pandas-datareader-0.7.0-py37_0

The following packages will be UPDATED:

  conda                                       4.6.14-py37_0 --> 4.7.11-py37_0



Downloading and Extracting Packages

conda-4.7.11         | 3.0 MB    |            |   0%
conda-4.7.11         | 3.0 MB    |            |   0%
conda-4.7.11         | 3.0 MB    | 1          |   2%
conda-4.7.11         | 3.0 MB    | 3          |   4%
conda-4.7.11         | 3.0 MB    | 4          |   5%
conda-4.7.11         | 3.0 MB    | 5          |   6%
conda-4.7.11         | 3.0 MB    | 8          |   9%
conda-4.7.11         | 3.0 MB    | #2         |  12%
conda-4.7.11         | 3.0 MB    | #4         |  15%
conda-4.7.11         | 3.0 MB    | #7         |  18%
conda-4.7.11         | 3.0 MB    | ##1        |  21%
conda-4.7.11         | 3.0 MB    | ##4        |  24%
conda-4.7.11         | 3.0 MB    | ##7        |  27%
conda-4.7.11         | 3.0 MB    | ###        |  30%
conda-4.7.11         | 3.0 MB    | ###2       |  33%
conda-4.7.11         | 3.0 MB    | ###6       |  36%
conda-4.7.11         | 3.0 MB    | ###9       |  39%
conda-4.7.11         | 3.0 MB    | ####2      |  42%
conda-4.7.11         | 3.0 MB    | ####5      |  46%
conda-4.7.11         | 3.0 MB    | ####9      |  49%
conda-4.7.11         | 3.0 MB    | #####2     |  52%
conda-4.7.11         | 3.0 MB    | #####5     |  55%
conda-4.7.11         | 3.0 MB    | #####8     |  58%
conda-4.7.11         | 3.0 MB    | ######1    |  62%
conda-4.7.11         | 3.0 MB    | ######5    |  65%
conda-4.7.11         | 3.0 MB    | ######8    |  68%
conda-4.7.11         | 3.0 MB    | #######1   |  71%
conda-4.7.11         | 3.0 MB    | #######4   |  74%
conda-4.7.11         | 3.0 MB    | ########   |  80%
conda-4.7.11         | 3.0 MB    | ########5  |  85%
conda-4.7.11         | 3.0 MB    | #########  |  90%
conda-4.7.11         | 3.0 MB    | #########7 |  97%
conda-4.7.11         | 3.0 MB    | ########## | 100%

conda-package-handli | 280 KB    |            |   0%
conda-package-handli | 280 KB    | 4          |   4%
conda-package-handli | 280 KB    | #2         |  13%
conda-package-handli | 280 KB    | #7         |  17%
conda-package-handli | 280 KB    | ##5        |  26%
conda-package-handli | 280 KB    | ###4       |  34%
conda-package-handli | 280 KB    | ######8    |  68%
conda-package-handli | 280 KB    | ########## | 100%

pandas-datareader-0. | 141 KB    |            |   0%
pandas-datareader-0. | 141 KB    | ##5        |  25%
pandas-datareader-0. | 141 KB    | #####9     |  59%
pandas-datareader-0. | 141 KB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... done
Executing transaction: ...working... done

Note: you may need to restart the kernel to use updated packages.

In [57]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
                    for ticker, data in all_data.items()}) #종가
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [58]:
returns = price.pct_change()

In [60]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-09-09  0.004267  0.014441 -0.011359 -0.000432
2019-09-10  0.011813  0.017181 -0.010471  0.001320
2019-09-11  0.031795 -0.009997  0.000294  0.011750
2019-09-12 -0.002236  0.000139  0.010285  0.011539
2019-09-13 -0.019454  0.000348 -0.001454  0.004302

In [61]:
returns['MSFT'].corr(returns['IBM'])

0.4915078464719328

In [62]:
returns['MSFT'].cov(returns['IBM'])

8.792653905903326e-05

In [64]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.386201  0.457512  0.463491
IBM   0.386201  1.000000  0.491508  0.407190
MSFT  0.457512  0.491508  1.000000  0.539238
GOOG  0.463491  0.407190  0.539238  1.000000

In [65]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000267  0.000078  0.000108  0.000118
IBM   0.000078  0.000153  0.000088  0.000078
MSFT  0.000108  0.000088  0.000209  0.000121
GOOG  0.000118  0.000078  0.000121  0.000242

In [66]:
returns.corrwith(returns.IBM)

AAPL    0.386201
IBM     1.000000
MSFT    0.491508
GOOG    0.407190
dtype: float64

In [67]:
returns.corrwith(volume)

AAPL   -0.062907
IBM    -0.151800
MSFT   -0.090255
GOOG   -0.019470
dtype: float64

#### 유일값, 값 세기, 멤버십

In [68]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [71]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [72]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [74]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
d    1
b    2
dtype: int64

### 중요 예제 isin method

In [77]:
mask = obj.isin(['b', 'c']) #불리언 벡터를 이용해 Series 또는 DataFrame의 값을 골라내고 싶을 때 유용

In [78]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [79]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [80]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [81]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

### 중요 예제!

In [83]:
data = pd.DataFrame({'Qu1': [1,3,4,3,4], 'Qu2': [2,3,1,2,3], 'Qu3':[1,5,2,4,4]})

In [84]:
result = data.apply(pd.value_counts).fillna(0)